/* Задание 4.
Реализовать основные 4 арифметические операции (+, -, /, *) в виде функций с двумя
параметрами. Т.е. например, функция для сложения должна принимать два числа, складывать их
и возвращать результат.
Обязательно использовать оператор return.
*/

'use strict'

function calc(a, b, sign) {
    if (sign == '*') {
        return a * b
    } else if (sign == '/') {
        return a / b
    } else if (sign == '+') {
        return a + b
    } else if (sign == '-') {
        return a - b
    }
}

console.log(calc(6, 3, '+'))