# Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и возвращающую словарь, в котором ключи — первые буквы имен, а значения — списки, содержащие имена, начинающиеся с соответствующей буквы. Например:
# >>> >>> thesaurus("Иван", "Мария", "Петр", "Илья")
# {
#     "И": ["Иван", "Илья"], 
#     "М": ["Мария"], "П": ["Петр"]
# }


def thesaurus(*args):
    dict = {}
    for i in args:
        if i[0] in dict:
            temp = dict[i[0]]
            temp.append(i)
            dict.update({i[0]: temp})           
        else:
            dict.update({i[0]: [i]})
    print(dict)


thesaurus("Иван", "Мария", 'Алексей',"Петр", "Илья", 'Александр', 'Михаил')