# Напишите программу, доказывающую или проверяющую, что для множества натуральных
# чисел выполняется равенство: 1+2+...+n = n(n+1)/2, где n - любое натуральное число.


n = int(input('Введите количество чисел '))
tmpList = []

for i in range(1, n + 1):   # формируем список из натуральных чисел и потом считаем его сумму
    tmpList.append(i)

print(f'Сумма множества "{n}" натуральных чисел = {sum(tmpList)}')
print(f'Сумма множества "{n}" натуральных чисел по формуле = {n * (n + 1) / 2}')
