# Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции вводятся пользователем. 
# После выполнения вычисления программа не должна завершаться, а должна запрашивать новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции. 
# Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и снова запрашивать знак операции.
# Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.

while True:
    a = int(input('a = '))
    b = int(input('b = '))
    print('Введите действие из списка: "+", "-", "/", "*".')
    print('Для выхода введите 0')
    symbol = input('Введите действие... ')
    if symbol == '0':
        break
    elif symbol == '+':
        print(f'Результат: {a + b}')
    elif symbol == '-':
        print(f'Результат: {a - b}')
    elif symbol == '/':
        if b == 0:
            print('Нельзя делить на ноль!')
        else:
            print(f'Результат: {a / b}')
    elif symbol == '*':
        print(f'Результат: {a * b}')
    

