# В программе генерируется случайное целое число от 0 до 100.
# Пользователь должен его отгадать не более чем за 10 попыток.
# После каждой неудачной попытки должно сообщаться больше или меньше введенное пользователем число, чем то, что загадано.
# Если за 10 попыток число не отгадано, то вывести загаданное число.

import random

randomNumber = random.randint(0, 100)
cnt = 1                                     # счетчик попыток
number = int(input('Угадайте число! '))

while True:
    if cnt == 10:
        print(f'Вы проиграли! Загаданное число "{randomNumber}"')
        break
    else:
        if number > randomNumber:
            print('Вы ввели слишком большое число.')
        elif number < randomNumber:
            print('Вы ввели слишком маленькое число.')
        elif number == randomNumber:
            print('Вы угадали!')
            break
        print(f'У вас осталось {10 - cnt} попыток')
        number = int(input('Введите еще раз... '))
        cnt += 1
