# Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.
# Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

dictionary = {}

for i in range (32, 128):
    dictionary[i] = chr(i)      # добавляем в словарь пару ключ значение, где ключ - код.

cnt = 1
for i in dictionary.items():    # выводим по 10 значений в строке
    if cnt == 10:
        cnt = 1
        print(i)
    else:
        print(i, end='\t')
        cnt += 1