# Создать вручную список, содержащий цены на товары (10–20 товаров), например:
# [57.8, 46.51, 97, ...]

# Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп.
# Например:
# 57 руб 08 коп, 46 руб 51 коп, 97 руб 00 коп, ...

# Подумать, как из цены получить рубли и копейки, как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).

# Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).

# Создать новый список, содержащий те же цены, но отсортированные по убыванию.

# Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?


lst = [57.8, 46.51, 97, 25.17, 16.08, 87.44, 95.12, 55, 42.7, 36.56, 99.77]
cnt1 = 0
print('Вывод цен через запятую:')
for i in lst:
    cnt1 += 1
    price = str(format(i, '.2f')).split('.')
    if cnt1 == len(lst):
        print(f'{price[0]} руб. {price[1]} коп. ID списка: {id(lst)}\n')
    else:
        print(f'{price[0]} руб. {price[1]} коп.', end=', ')

# цены, отсортированные по возрастанию
lst.sort()
cnt2 = 0
print('Сортировка по возрастанию:')
for i in lst:
    cnt2 += 1
    price = str(format(i, '.2f')).split('.')
    if cnt2 == len(lst):
        print(f'{price[0]} руб. {price[1]} коп. ID списка: {id(lst)}\n')
    else:
        print(f'{price[0]} руб. {price[1]} коп.', end=', ')

# Создать новый список, содержащий те же цены, но отсортированные по убыванию.

newLst = sorted(lst, reverse=True)
cnt3 = 0
print('Сортировка по убыванию:')
for i in newLst:
    cnt3 += 1
    price = str(format(i, '.2f')).split('.')
    if cnt3 == len(lst):
        print(f'{price[0]} руб. {price[1]} коп. ID списка: {id(newLst)}\n')
    else:
        print(f'{price[0]} руб. {price[1]} коп.', end=', ')

# Вывести цены пяти самых дорогих товаров
cnt4 = 0
print('ТОП 5 цен:')
for i in newLst[:5]:
    cnt4 += 1
    price = str(format(i, '.2f')).split('.')
    if cnt4 == 5:
        print(f'{price[0]} руб. {price[1]} коп.')
    else:
        print(f'{price[0]} руб. {price[1]} коп.', end=', ')

    