# В массиве найти максимальный отрицательный элемент. Вывести на экран его значение и позицию в массиве.

lst = [15, -8, -3, 84, 6, 4, -2, 15, 2]
negativeLst = []

for number in lst:                  # отбираем все отрицательные элементы
    if number < 0:
        negativeLst.append(number)

for e, number in enumerate(lst):    # ищем позицию максимального отрицательного элемента в исходном списке
    if number == max(negativeLst):
        print(f'Максимальный отрицательный элемент = "{number}" его позиция в списке "{e}"')
