# Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо заполнить
# значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.

lst = [8, 3, 84, 15, 6, 4, 2]
lstIndex = []

for e, number in enumerate(lst):    
    if number % 2 == 0:
        lstIndex.append(e)          # если элемент списка делется на 2, то добавляем его индекс в новый список

print(lstIndex)