# Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
# Программа должна вычислять сумму введенных элементов каждой строки и записывать ее в последнюю ячейку строки.
# В конце следует вывести полученную матрицу.

st1 = list(map(int, input('Введите 1 строку: ').split()))   # собираем с ввода числа через пробел и преобразуем их в int и в список
st2 = list(map(int, input('Введите 2 строку: ').split()))
st3 = list(map(int, input('Введите 3 строку: ').split()))
st4 = list(map(int, input('Введите 4 строку: ').split()))
st5 = list(map(int, input('Введите 5 строку: ').split()))

st1.append(sum(st1))                                        # добавляем в каждую строку сумму значений
st2.append(sum(st2))
st3.append(sum(st3))
st4.append(sum(st4))
st5.append(sum(st5))

matrix = [st1, st2, st3, st4, st5]                          # выводим в консоль
for i in matrix:
    print(i)
