# Найти максимальный элемент среди минимальных элементов столбцов матрицы.


matrix = [[1, 4, 7, 12], [6, 3, 2, 11], [2, 8, 7, 17], [9, 6, 4, 19], [4, 7, 8, 19]]
minElems = []

for numbers in matrix:                  # добавляем все минимальные элементы в отдельный список
    minElems.append(min(numbers))

print(f'Максимальный элемент из минимальных равен {max(minElems)}')
    