'use strict';

/* Задание 1.
Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в
градусах по Фаренгейту.
*/
let Tc = prompt('Введите температуру в градусах Цельсия');
alert(`Температура в градусах Фаренгейта = ${(9 / 5) * Tc + 32}`)

/* Задание 2.
Объявить две переменные: admin и name. Записать в name строку "Василий". Скопировать
значение из name в admin. Вывести в консоль переменную admin (должно вывести "Василий").
*/

let name = 'Василий'
let admin = name
console.log(admin)

/* Задание 3.
Вывести в консоль значения выражений и объяснить почему получились такие значения
используя комментарии к каждому выражению
*/

/*
1. Суммирование происходит слева направо.
Сначала сложились два числа, потом произошло приведение типов и 20 привратилось в строку;
2. Суммирование происходит слева направо.
Так как вторым по порядку идет строка, то из-за знака "+" первая десятка привелась к строке.
Тоже самое произошло с последней десяткой.
3. Выяснил с помощью функции typeof, что +"10" будет числом.
Поэтому складывая все числа получаем число на выходе.
4. Опытным путем выяснил что -"" и +"" дают отрицательный и положительный соответственно.
А так как на ноль делить нельзя получаем -infinity
 */
let result = 10 / -"";
console.log(result);