"""
Создайте собственный класс-исключение, обрабатывающий ситуацию деления на ноль.
Проверьте его работу на данных, вводимых пользователем.
При вводе нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.
"""
class ZeroDivision(Exception):

    def __init__(self, txt):
        self.txt = txt

number = int(input('Введите делитель\n'))

try:
    if number == 0:
        raise ZeroDivision('Нельзя делить на ноль!')
except ZeroDivision:
    print('Вы разделили на ноль и схлопнули континум')