"""
Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо только числами.
Класс-исключение должен контролировать типы данных элементов списка.
"""
class IntList(Exception):
    pass


num_list = []
while True:
    num = input('Введите число. Другие символы не допустимы. Для выхода введите "stop"\n')
    if num == 'stop':
        break
    try:
        if not num.isdigit():
            raise IntList 
        else:
            num_list.append(int(num))       
    except IntList:
        print('Введите все-таки число')

print(num_list)
