"""
Создайте объект-генератор, выбирающий из функции-генератора rand_nums, написанного в предыдущем задании, только нечетные числа.
Проитерируйтесь по этому объекту-генератору и выведите на экран для каждого значения на отдельной строке: порядковый номер (начиная с 1-го) и соответствующее ему значение. Например:
1 11
...
10 7

Ниже в комментарии к задаче напишите какое N надо передать в функцию-генератор rand_nums, чтобы объект-генератор вернул нам не менее 20 значений.
Например:
# В rand_nums надо передать ______ (число)
"""

from task1 import rand_nums

nums_odd = (nums for nums in rand_nums(21) if nums % 2 != 0)

cnt = 1
for i in nums_odd:
    print(f'{cnt} {i}')
    cnt += 1

# Мы не можем напрямую сказать какое число необходимо передать, поскольку от нас не зависит количество генерируемых нечетных чисел.
    

